{
  "_name_or_path": "roberta-base",
  "architectures": [
    "RobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-Rating",
    "1": "I-Rating",
    "2": "O",
    "3": "B-Amenity",
    "4": "I-Amenity",
    "5": "B-Location",
    "6": "I-Location",
    "7": "B-Restaurant_Name",
    "8": "I-Restaurant_Name",
    "9": "B-Price",
    "10": "B-Hours",
    "11": "I-Hours",
    "12": "B-Dish",
    "13": "I-Dish",
    "14": "B-Cuisine",
    "15": "I-Price",
    "16": "I-Cuisine"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-Amenity": 3,
    "B-Cuisine": 14,
    "B-Dish": 12,
    "B-Hours": 10,
    "B-Location": 5,
    "B-Price": 9,
    "B-Rating": 0,
    "B-Restaurant_Name": 7,
    "I-Amenity": 4,
    "I-Cuisine": 16,
    "I-Dish": 13,
    "I-Hours": 11,
    "I-Location": 6,
    "I-Price": 15,
    "I-Rating": 1,
    "I-Restaurant_Name": 8,
    "O": 2
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.28.1",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
